SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26_eusart.h
/* Bit fields for EUSART CFG1 */
#define _EUSART_CFG1_RESETVALUE                       0x00000000UL                                /**< Default value for EUSART_CFG1               */
#define _EUSART_CFG1_MASK                             0x7BCF8E7FUL                                /**< Mask for EUSART_CFG1                        */
#define EUSART_CFG1_DBGHALT                           (0x1UL << 0)                                /**< Debug halt                                  */
#define _EUSART_CFG1_DBGHALT_SHIFT                    0                                           /**< Shift value for EUSART_DBGHALT              */
#define _EUSART_CFG1_DBGHALT_MASK                     0x1UL                                       /**< Bit mask for EUSART_DBGHALT                 */
#define _EUSART_CFG1_DBGHALT_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_DBGHALT_DISABLE                  0x00000000UL                                /**< Mode DISABLE for EUSART_CFG1                */
#define _EUSART_CFG1_DBGHALT_ENABLE                   0x00000001UL                                /**< Mode ENABLE for EUSART_CFG1                 */
#define EUSART_CFG1_DBGHALT_DEFAULT                   (_EUSART_CFG1_DBGHALT_DEFAULT << 0)         /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_DBGHALT_DISABLE                   (_EUSART_CFG1_DBGHALT_DISABLE << 0)         /**< Shifted mode DISABLE for EUSART_CFG1        */
#define EUSART_CFG1_DBGHALT_ENABLE                    (_EUSART_CFG1_DBGHALT_ENABLE << 0)          /**< Shifted mode ENABLE for EUSART_CFG1         */
#define EUSART_CFG1_CTSINV                            (0x1UL << 1)                                /**< Clear-to-send Invert Enable                 */
#define _EUSART_CFG1_CTSINV_SHIFT                     1                                           /**< Shift value for EUSART_CTSINV               */
#define _EUSART_CFG1_CTSINV_MASK                      0x2UL                                       /**< Bit mask for EUSART_CTSINV                  */
#define _EUSART_CFG1_CTSINV_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_CTSINV_DISABLE                   0x00000000UL                                /**< Mode DISABLE for EUSART_CFG1                */
#define _EUSART_CFG1_CTSINV_ENABLE                    0x00000001UL                                /**< Mode ENABLE for EUSART_CFG1                 */
#define EUSART_CFG1_CTSINV_DEFAULT                    (_EUSART_CFG1_CTSINV_DEFAULT << 1)          /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_CTSINV_DISABLE                    (_EUSART_CFG1_CTSINV_DISABLE << 1)          /**< Shifted mode DISABLE for EUSART_CFG1        */
#define EUSART_CFG1_CTSINV_ENABLE                     (_EUSART_CFG1_CTSINV_ENABLE << 1)           /**< Shifted mode ENABLE for EUSART_CFG1         */
#define EUSART_CFG1_CTSEN                             (0x1UL << 2)                                /**< Clear-to-send Enable                        */
#define _EUSART_CFG1_CTSEN_SHIFT                      2                                           /**< Shift value for EUSART_CTSEN                */
#define _EUSART_CFG1_CTSEN_MASK                       0x4UL                                       /**< Bit mask for EUSART_CTSEN                   */
#define _EUSART_CFG1_CTSEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_CTSEN_DISABLE                    0x00000000UL                                /**< Mode DISABLE for EUSART_CFG1                */
#define _EUSART_CFG1_CTSEN_ENABLE                     0x00000001UL                                /**< Mode ENABLE for EUSART_CFG1                 */
#define EUSART_CFG1_CTSEN_DEFAULT                     (_EUSART_CFG1_CTSEN_DEFAULT << 2)           /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_CTSEN_DISABLE                     (_EUSART_CFG1_CTSEN_DISABLE << 2)           /**< Shifted mode DISABLE for EUSART_CFG1        */
#define EUSART_CFG1_CTSEN_ENABLE                      (_EUSART_CFG1_CTSEN_ENABLE << 2)            /**< Shifted mode ENABLE for EUSART_CFG1         */
#define EUSART_CFG1_RTSINV                            (0x1UL << 3)                                /**< Request-to-send Invert Enable               */
#define _EUSART_CFG1_RTSINV_SHIFT                     3                                           /**< Shift value for EUSART_RTSINV               */
#define _EUSART_CFG1_RTSINV_MASK                      0x8UL                                       /**< Bit mask for EUSART_RTSINV                  */
#define _EUSART_CFG1_RTSINV_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_RTSINV_DISABLE                   0x00000000UL                                /**< Mode DISABLE for EUSART_CFG1                */
#define _EUSART_CFG1_RTSINV_ENABLE                    0x00000001UL                                /**< Mode ENABLE for EUSART_CFG1                 */
#define EUSART_CFG1_RTSINV_DEFAULT                    (_EUSART_CFG1_RTSINV_DEFAULT << 3)          /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_RTSINV_DISABLE                    (_EUSART_CFG1_RTSINV_DISABLE << 3)          /**< Shifted mode DISABLE for EUSART_CFG1        */
#define EUSART_CFG1_RTSINV_ENABLE                     (_EUSART_CFG1_RTSINV_ENABLE << 3)           /**< Shifted mode ENABLE for EUSART_CFG1         */
#define _EUSART_CFG1_RXTIMEOUT_SHIFT                  4                                           /**< Shift value for EUSART_RXTIMEOUT            */
#define _EUSART_CFG1_RXTIMEOUT_MASK                   0x70UL                                      /**< Bit mask for EUSART_RXTIMEOUT               */
#define _EUSART_CFG1_RXTIMEOUT_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_RXTIMEOUT_DISABLED               0x00000000UL                                /**< Mode DISABLED for EUSART_CFG1               */
#define _EUSART_CFG1_RXTIMEOUT_ONEFRAME               0x00000001UL                                /**< Mode ONEFRAME for EUSART_CFG1               */
#define _EUSART_CFG1_RXTIMEOUT_TWOFRAMES              0x00000002UL                                /**< Mode TWOFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_RXTIMEOUT_THREEFRAMES            0x00000003UL                                /**< Mode THREEFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_RXTIMEOUT_FOURFRAMES             0x00000004UL                                /**< Mode FOURFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RXTIMEOUT_FIVEFRAMES             0x00000005UL                                /**< Mode FIVEFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RXTIMEOUT_SIXFRAMES              0x00000006UL                                /**< Mode SIXFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_RXTIMEOUT_SEVENFRAMES            0x00000007UL                                /**< Mode SEVENFRAMES for EUSART_CFG1            */
#define EUSART_CFG1_RXTIMEOUT_DEFAULT                 (_EUSART_CFG1_RXTIMEOUT_DEFAULT << 4)       /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_RXTIMEOUT_DISABLED                (_EUSART_CFG1_RXTIMEOUT_DISABLED << 4)      /**< Shifted mode DISABLED for EUSART_CFG1       */
#define EUSART_CFG1_RXTIMEOUT_ONEFRAME                (_EUSART_CFG1_RXTIMEOUT_ONEFRAME << 4)      /**< Shifted mode ONEFRAME for EUSART_CFG1       */
#define EUSART_CFG1_RXTIMEOUT_TWOFRAMES               (_EUSART_CFG1_RXTIMEOUT_TWOFRAMES << 4)     /**< Shifted mode TWOFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RXTIMEOUT_THREEFRAMES             (_EUSART_CFG1_RXTIMEOUT_THREEFRAMES << 4)   /**< Shifted mode THREEFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RXTIMEOUT_FOURFRAMES              (_EUSART_CFG1_RXTIMEOUT_FOURFRAMES << 4)    /**< Shifted mode FOURFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RXTIMEOUT_FIVEFRAMES              (_EUSART_CFG1_RXTIMEOUT_FIVEFRAMES << 4)    /**< Shifted mode FIVEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RXTIMEOUT_SIXFRAMES               (_EUSART_CFG1_RXTIMEOUT_SIXFRAMES << 4)     /**< Shifted mode SIXFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RXTIMEOUT_SEVENFRAMES             (_EUSART_CFG1_RXTIMEOUT_SEVENFRAMES << 4)   /**< Shifted mode SEVENFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_TXDMAWU                           (0x1UL << 9)                                /**< Transmitter DMA Wakeup                      */
#define _EUSART_CFG1_TXDMAWU_SHIFT                    9                                           /**< Shift value for EUSART_TXDMAWU              */
#define _EUSART_CFG1_TXDMAWU_MASK                     0x200UL                                     /**< Bit mask for EUSART_TXDMAWU                 */
#define _EUSART_CFG1_TXDMAWU_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define EUSART_CFG1_TXDMAWU_DEFAULT                   (_EUSART_CFG1_TXDMAWU_DEFAULT << 9)         /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_RXDMAWU                           (0x1UL << 10)                               /**< Receiver DMA Wakeup                         */
#define _EUSART_CFG1_RXDMAWU_SHIFT                    10                                          /**< Shift value for EUSART_RXDMAWU              */
#define _EUSART_CFG1_RXDMAWU_MASK                     0x400UL                                     /**< Bit mask for EUSART_RXDMAWU                 */
#define _EUSART_CFG1_RXDMAWU_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define EUSART_CFG1_RXDMAWU_DEFAULT                   (_EUSART_CFG1_RXDMAWU_DEFAULT << 10)        /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_SFUBRX                            (0x1UL << 11)                               /**< Start Frame Unblock Receiver                */
#define _EUSART_CFG1_SFUBRX_SHIFT                     11                                          /**< Shift value for EUSART_SFUBRX               */
#define _EUSART_CFG1_SFUBRX_MASK                      0x800UL                                     /**< Bit mask for EUSART_SFUBRX                  */
#define _EUSART_CFG1_SFUBRX_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define EUSART_CFG1_SFUBRX_DEFAULT                    (_EUSART_CFG1_SFUBRX_DEFAULT << 11)         /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_RXPRSEN                           (0x1UL << 15)                               /**< PRS RX Enable                               */
#define _EUSART_CFG1_RXPRSEN_SHIFT                    15                                          /**< Shift value for EUSART_RXPRSEN              */
#define _EUSART_CFG1_RXPRSEN_MASK                     0x8000UL                                    /**< Bit mask for EUSART_RXPRSEN                 */
#define _EUSART_CFG1_RXPRSEN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define EUSART_CFG1_RXPRSEN_DEFAULT                   (_EUSART_CFG1_RXPRSEN_DEFAULT << 15)        /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define _EUSART_CFG1_TXFIW_SHIFT                      16                                          /**< Shift value for EUSART_TXFIW                */
#define _EUSART_CFG1_TXFIW_MASK                       0xF0000UL                                   /**< Bit mask for EUSART_TXFIW                   */
#define _EUSART_CFG1_TXFIW_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_TXFIW_ONEFRAME                   0x00000000UL                                /**< Mode ONEFRAME for EUSART_CFG1               */
#define _EUSART_CFG1_TXFIW_TWOFRAMES                  0x00000001UL                                /**< Mode TWOFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_TXFIW_THREEFRAMES                0x00000002UL                                /**< Mode THREEFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_TXFIW_FOURFRAMES                 0x00000003UL                                /**< Mode FOURFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_TXFIW_FIVEFRAMES                 0x00000004UL                                /**< Mode FIVEFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_TXFIW_SIXFRAMES                  0x00000005UL                                /**< Mode SIXFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_TXFIW_SEVENFRAMES                0x00000006UL                                /**< Mode SEVENFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_TXFIW_EIGHTFRAMES                0x00000007UL                                /**< Mode EIGHTFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_TXFIW_NINEFRAMES                 0x00000008UL                                /**< Mode NINEFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_TXFIW_TENFRAMES                  0x00000009UL                                /**< Mode TENFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_TXFIW_ELEVENFRAMES               0x0000000AUL                                /**< Mode ELEVENFRAMES for EUSART_CFG1           */
#define _EUSART_CFG1_TXFIW_TWELVEFRAMES               0x0000000BUL                                /**< Mode TWELVEFRAMES for EUSART_CFG1           */
#define _EUSART_CFG1_TXFIW_THIRTEENFRAMES             0x0000000CUL                                /**< Mode THIRTEENFRAMES for EUSART_CFG1         */
#define _EUSART_CFG1_TXFIW_FOURTEENFRAMES             0x0000000DUL                                /**< Mode FOURTEENFRAMES for EUSART_CFG1         */
#define _EUSART_CFG1_TXFIW_FIFTEENFRAMES              0x0000000EUL                                /**< Mode FIFTEENFRAMES for EUSART_CFG1          */
#define _EUSART_CFG1_TXFIW_SIXTEENFRAMES              0x0000000FUL                                /**< Mode SIXTEENFRAMES for EUSART_CFG1          */
#define EUSART_CFG1_TXFIW_DEFAULT                     (_EUSART_CFG1_TXFIW_DEFAULT << 16)          /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_TXFIW_ONEFRAME                    (_EUSART_CFG1_TXFIW_ONEFRAME << 16)         /**< Shifted mode ONEFRAME for EUSART_CFG1       */
#define EUSART_CFG1_TXFIW_TWOFRAMES                   (_EUSART_CFG1_TXFIW_TWOFRAMES << 16)        /**< Shifted mode TWOFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_TXFIW_THREEFRAMES                 (_EUSART_CFG1_TXFIW_THREEFRAMES << 16)      /**< Shifted mode THREEFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_TXFIW_FOURFRAMES                  (_EUSART_CFG1_TXFIW_FOURFRAMES << 16)       /**< Shifted mode FOURFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_TXFIW_FIVEFRAMES                  (_EUSART_CFG1_TXFIW_FIVEFRAMES << 16)       /**< Shifted mode FIVEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_TXFIW_SIXFRAMES                   (_EUSART_CFG1_TXFIW_SIXFRAMES << 16)        /**< Shifted mode SIXFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_TXFIW_SEVENFRAMES                 (_EUSART_CFG1_TXFIW_SEVENFRAMES << 16)      /**< Shifted mode SEVENFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_TXFIW_EIGHTFRAMES                 (_EUSART_CFG1_TXFIW_EIGHTFRAMES << 16)      /**< Shifted mode EIGHTFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_TXFIW_NINEFRAMES                  (_EUSART_CFG1_TXFIW_NINEFRAMES << 16)       /**< Shifted mode NINEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_TXFIW_TENFRAMES                   (_EUSART_CFG1_TXFIW_TENFRAMES << 16)        /**< Shifted mode TENFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_TXFIW_ELEVENFRAMES                (_EUSART_CFG1_TXFIW_ELEVENFRAMES << 16)     /**< Shifted mode ELEVENFRAMES for EUSART_CFG1   */
#define EUSART_CFG1_TXFIW_TWELVEFRAMES                (_EUSART_CFG1_TXFIW_TWELVEFRAMES << 16)     /**< Shifted mode TWELVEFRAMES for EUSART_CFG1   */
#define EUSART_CFG1_TXFIW_THIRTEENFRAMES              (_EUSART_CFG1_TXFIW_THIRTEENFRAMES << 16)   /**< Shifted mode THIRTEENFRAMES for EUSART_CFG1 */
#define EUSART_CFG1_TXFIW_FOURTEENFRAMES              (_EUSART_CFG1_TXFIW_FOURTEENFRAMES << 16)   /**< Shifted mode FOURTEENFRAMES for EUSART_CFG1 */
#define EUSART_CFG1_TXFIW_FIFTEENFRAMES               (_EUSART_CFG1_TXFIW_FIFTEENFRAMES << 16)    /**< Shifted mode FIFTEENFRAMES for EUSART_CFG1  */
#define EUSART_CFG1_TXFIW_SIXTEENFRAMES               (_EUSART_CFG1_TXFIW_SIXTEENFRAMES << 16)    /**< Shifted mode SIXTEENFRAMES for EUSART_CFG1  */
#define _EUSART_CFG1_RTSRXFW_SHIFT                    22                                          /**< Shift value for EUSART_RTSRXFW              */
#define _EUSART_CFG1_RTSRXFW_MASK                     0x3C00000UL                                 /**< Bit mask for EUSART_RTSRXFW                 */
#define _EUSART_CFG1_RTSRXFW_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_RTSRXFW_ONEFRAME                 0x00000000UL                                /**< Mode ONEFRAME for EUSART_CFG1               */
#define _EUSART_CFG1_RTSRXFW_TWOFRAMES                0x00000001UL                                /**< Mode TWOFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_RTSRXFW_THREEFRAMES              0x00000002UL                                /**< Mode THREEFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_RTSRXFW_FOURFRAMES               0x00000003UL                                /**< Mode FOURFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RTSRXFW_FIVEFRAMES               0x00000004UL                                /**< Mode FIVEFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RTSRXFW_SIXFRAMES                0x00000005UL                                /**< Mode SIXFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_RTSRXFW_SEVENFRAMES              0x00000006UL                                /**< Mode SEVENFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_RTSRXFW_EIGHTFRAMES              0x00000007UL                                /**< Mode EIGHTFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_RTSRXFW_NINEFRAMES               0x00000008UL                                /**< Mode NINEFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RTSRXFW_TENFRAMES                0x00000009UL                                /**< Mode TENFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_RTSRXFW_ELEVENFRAMES             0x0000000AUL                                /**< Mode ELEVENFRAMES for EUSART_CFG1           */
#define _EUSART_CFG1_RTSRXFW_TWELVEFRAMES             0x0000000BUL                                /**< Mode TWELVEFRAMES for EUSART_CFG1           */
#define _EUSART_CFG1_RTSRXFW_THIRTEENFRAMES           0x0000000CUL                                /**< Mode THIRTEENFRAMES for EUSART_CFG1         */
#define _EUSART_CFG1_RTSRXFW_FOURTEENFRAMES           0x0000000DUL                                /**< Mode FOURTEENFRAMES for EUSART_CFG1         */
#define _EUSART_CFG1_RTSRXFW_FIFTEENFRAMES            0x0000000EUL                                /**< Mode FIFTEENFRAMES for EUSART_CFG1          */
#define _EUSART_CFG1_RTSRXFW_SIXTEENFRAMES            0x0000000FUL                                /**< Mode SIXTEENFRAMES for EUSART_CFG1          */
#define EUSART_CFG1_RTSRXFW_DEFAULT                   (_EUSART_CFG1_RTSRXFW_DEFAULT << 22)        /**< Shifted mode DEFAULT for EUSART_CFG1        */
#define EUSART_CFG1_RTSRXFW_ONEFRAME                  (_EUSART_CFG1_RTSRXFW_ONEFRAME << 22)       /**< Shifted mode ONEFRAME for EUSART_CFG1       */
#define EUSART_CFG1_RTSRXFW_TWOFRAMES                 (_EUSART_CFG1_RTSRXFW_TWOFRAMES << 22)      /**< Shifted mode TWOFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RTSRXFW_THREEFRAMES               (_EUSART_CFG1_RTSRXFW_THREEFRAMES << 22)    /**< Shifted mode THREEFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RTSRXFW_FOURFRAMES                (_EUSART_CFG1_RTSRXFW_FOURFRAMES << 22)     /**< Shifted mode FOURFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RTSRXFW_FIVEFRAMES                (_EUSART_CFG1_RTSRXFW_FIVEFRAMES << 22)     /**< Shifted mode FIVEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RTSRXFW_SIXFRAMES                 (_EUSART_CFG1_RTSRXFW_SIXFRAMES << 22)      /**< Shifted mode SIXFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RTSRXFW_SEVENFRAMES               (_EUSART_CFG1_RTSRXFW_SEVENFRAMES << 22)    /**< Shifted mode SEVENFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RTSRXFW_EIGHTFRAMES               (_EUSART_CFG1_RTSRXFW_EIGHTFRAMES << 22)    /**< Shifted mode EIGHTFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RTSRXFW_NINEFRAMES                (_EUSART_CFG1_RTSRXFW_NINEFRAMES << 22)     /**< Shifted mode NINEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RTSRXFW_TENFRAMES                 (_EUSART_CFG1_RTSRXFW_TENFRAMES << 22)      /**< Shifted mode TENFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RTSRXFW_ELEVENFRAMES              (_EUSART_CFG1_RTSRXFW_ELEVENFRAMES << 22)   /**< Shifted mode ELEVENFRAMES for EUSART_CFG1   */
#define EUSART_CFG1_RTSRXFW_TWELVEFRAMES              (_EUSART_CFG1_RTSRXFW_TWELVEFRAMES << 22)   /**< Shifted mode TWELVEFRAMES for EUSART_CFG1   */
#define EUSART_CFG1_RTSRXFW_THIRTEENFRAMES            (_EUSART_CFG1_RTSRXFW_THIRTEENFRAMES << 22) /**< Shifted mode THIRTEENFRAMES for EUSART_CFG1 */
#define EUSART_CFG1_RTSRXFW_FOURTEENFRAMES            (_EUSART_CFG1_RTSRXFW_FOURTEENFRAMES << 22) /**< Shifted mode FOURTEENFRAMES for EUSART_CFG1 */
#define EUSART_CFG1_RTSRXFW_FIFTEENFRAMES             (_EUSART_CFG1_RTSRXFW_FIFTEENFRAMES << 22)  /**< Shifted mode FIFTEENFRAMES for EUSART_CFG1  */
#define EUSART_CFG1_RTSRXFW_SIXTEENFRAMES             (_EUSART_CFG1_RTSRXFW_SIXTEENFRAMES << 22)  /**< Shifted mode SIXTEENFRAMES for EUSART_CFG1  */
#define _EUSART_CFG1_RXFIW_SHIFT                      27                                          /**< Shift value for EUSART_RXFIW                */
#define _EUSART_CFG1_RXFIW_MASK                       0x78000000UL                                /**< Bit mask for EUSART_RXFIW                   */
#define _EUSART_CFG1_RXFIW_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for EUSART_CFG1                */
#define _EUSART_CFG1_RXFIW_ONEFRAME                   0x00000000UL                                /**< Mode ONEFRAME for EUSART_CFG1               */
#define _EUSART_CFG1_RXFIW_TWOFRAMES                  0x00000001UL                                /**< Mode TWOFRAMES for EUSART_CFG1              */
#define _EUSART_CFG1_RXFIW_THREEFRAMES                0x00000002UL                                /**< Mode THREEFRAMES for EUSART_CFG1            */
#define _EUSART_CFG1_RXFIW_FOURFRAMES                 0x00000003UL                                /**< Mode FOURFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RXFIW_FIVEFRAMES                 0x00000004UL                                /**< Mode FIVEFRAMES for EUSART_CFG1             */
#define _EUSART_CFG1_RXFIW_SIXFRAMES                  0x00000005UL                                /**< Mode SIXFRAMES for EUSART_CFG1              */
